/**
 * @module DataScouting
 * @desc Prototype module of ECARLE
 * @authors Iordanis Kostelidis, Ioakeim James Theologou
 * @license MPL 2.0
 * @copyright Mangalam Research Center for Buddhist Languages
 * @modified DataScouting
 */

getDocHtmlUrlPattern = () => {
    return "http://localhost:8088/schemas/tei-doc/ref-${name:s(\":\",\"_\")}.html";
};

const defaultTEI = "<TEI xmlns=\"http://www.tei-c.org/ns/1.0\">\n" +
    "   <teiHeader>\n" +
    "      <fileDesc>\n" +
    "         <titleStmt>\n" +
    "            <title>Ο Λέανδρος (απόσπασμα)</title>\n" +
    "            <author>Παναγιώτης Σούτσος</author>\n" +
    "         </titleStmt>\n" +
    "         <publicationStmt>\n" +
    "            <p>Δοκιμαστική εξωγωγή οντοτήτων</p>\n" +
    "         </publicationStmt>\n" +
    "         <sourceDesc>\n" +
    "            <p>Π. Σούτσος, Ο Λέανδρος, εν Ναυπλίω, εκ της τυπογραφίας Κωνσταντίνου Ιωαννίδου Τόμπρα\n" +
    "               Κυδωνιέως και Κωνσταντίνου Ιωαννίδου Σμυρναίου, 1834, σσ. 40-56 </p>\n" +
    "         </sourceDesc>\n" +
    "      </fileDesc>\n" +
    "   </teiHeader>\n" +
    "   <text>\n" +
    "      <body>\n" +
    "         <div n=\"31\" type=\"chapter\">\n" +
    "            <head>ΕΠΙΣΤΟΛΗ ΛΑ΄. Ὁ Λέανδρος.</head>\n" +
    "            <opener><dateline>(Τὴν αὐτὴν ἡμέραν. [14 Ἰανουαρίου 1834]) </dateline></opener>\n" +
    "            <p>Περιφέρομαι μόνος, βιασμένος νὰ βλέπω ξένα πρόσωπα καὶ νὰ ἔχω συνοδοιπόρον μου μόνον\n" +
    "               τὸν ἐρημίτην συλλογισμόν· φεύγω· ποταμοὶ, βουνὰ, μένουσιν ὀπίσω μου· κάθε βῆμά μου μὲ\n" +
    "               ἀπομακρύνει ἀπὸ τὴν <persName>Κοραλίαν</persName> μου, καὶ τῆς παρελθούσης εὐτυχίας\n" +
    "               μου αἱ τελευταῖαι σκηναὶ βαθμηδὸν ἐξαλείφονται. </p>\n" +
    "            <p>Πόσον εἶναι σκληρὰ ἡ προσήλωσις τῆς λύπης! οἰκτείρω μόνος ἐμαυτόν· τόσοι βαδίζουσι\n" +
    "               μετὰ φαιδροῦ προσώπου εἰς τὴν κοινὴν ὁδν, καὶ ἡδονὴν εὑρίσκουσιν εἰς τὰς μονοτόνους\n" +
    "               σκηνὰς τῆς ζωῆς! βλέπω τὴν στιγμὴν ταύτην δυὸ γέροντας θερμαινομένους εἰς τὸν ἥλιον·\n" +
    "               μία τοῦ ἡλίου ἀκτὶς εἰς αὐτοὺς φέρει τόσην ἡδονήν! καὶ νέος ἐγώ, καὶ εἰς τὸ μέτωπόν\n" +
    "               μου ἐγκλείων κόσμον ὁλόκληρον ἰδεῶν, δὲν δύναμαι νὰ εὕρω ἕν ἀντικείμενον εὐχάριστον,\n" +
    "               καὶ μίαν μόνην παραμυθητικὴν ἰδέαν! </p>\n" +
    "            <p>Ἀπεχαιρέτησα χθὲς καὶ τὸν <placeName>Ὑμητὸν</placeName> τὸν κατάφυτον ἀπὸ θύμον\n" +
    "               εὐώδη, καὶ <placeName>τὸ ὄρος τοῦ καλλιμαρμάρου Πεντελικοῦ</placeName>, ὅπου ἔλαφοι\n" +
    "               καὶ ἄρκτοι τὰς φωλεὰς των κρύπτουσι, καὶ τὸν ὑψιχαίτην\n" +
    "                  <placeName>Λυκαβητόν</placeName>, καὶ τὸ πολύχρυσον\n" +
    "               <placeName>Λαύριον</placeName>· ἀπεχαιρέτησα καὶ τὸν <placeName>Ἠλυσσόν</placeName>,\n" +
    "               καὶ τὴν θυγατέρα τοῦ <persName>Καλλιῤῥόην</persName>, καὶ τὴν <placeName>Μαραθώνιον\n" +
    "                  λίμνην</placeName>, ὅπου συνεκροτήθη ἄλλοτε ἡ ἐν <placeName>Μαραθῶνι</placeName>\n" +
    "               μάχη, καὶ τὸν πρὸς ἄρκτον της κωνοειδῆ λόφον, τὸν καλύπτοντα τὰ ὀστᾱ τῶν ἐν\n" +
    "                  <placeName>Μαραθῶνι</placeName> πεσόντων Ἡρώων. Ἀπεχαιρέτησα τὴν γῆν τῆς\n" +
    "                  <placeName>Ἀττικῆς</placeName> τὴν ἔτι κρύπτουσαν εἰς τὰ σπλάγχνα της καὶ ναοὺς\n" +
    "               λευκοστύλους, καὶ ἀνδριάντας χαλκίνους, καὶ ἀργυρᾱ νομίσματα, καὶ μυροδόχους καὶ\n" +
    "               δακρυδόχους λάρνακας· ἀναβὰς εἰς τὴν <placeName>Ἀκρόπολιν</placeName>, εἰς τὰ ἐρείπια\n" +
    "               τῆς <persName>Πολιάδος Ἀθηνᾶς</persName> ἐκάθησα, ὅπου ἄλλοτε ἵστατο τὸ κολοσσαῖον\n" +
    "               καὶ χρύσινον ἐκεῖνο τοῦ <persName>Φειδίου</persName> ἄγαλμα, καὶ ὡς τρόπαιον\n" +
    "               ἐκρέμαντο ἡ μάχαιρα τοῦ <persName>Μαρδονίου</persName>, καὶ ὁ θώραξ τοῦ συστρατήγου\n" +
    "               του Πέρσου· ἔστρεψα τὰ ὄμματά μου πέριξ τῆς <placeName>Ἀκροπόλεως</placeName>· δὲν\n" +
    "               εἶδα εἰς τὰ τείχη της τὴν κεχρυσωμένην κεφαλὴν τῆς <persName>Μεδούσης</persName>,\n" +
    "               ἥτις ἤστραπτε τὸ πάλαι, ἀντανακλῶσα τὰς ἀκτῖνας τοῦ ἡλίου· ἔστρεψα τὰ ὄμματά μου κάτω\n" +
    "               τῆς <placeName>Ἀκροπόλεως</placeName>· ποῦ οἱ Πρυτάνεις καὶ τὸ\n" +
    "                  <orgName>Πρυτανεῖον</orgName>; ποῦ ἡ <placeName>Πνύξ</placeName>, καὶ ὁ\n" +
    "                  <persName>Δημοσθένης</persName> της; ποῦ τὸ <orgName>Ὠδεῖον</orgName>, καὶ οἱ\n" +
    "                  <persName>Αἰσχύλοι</persName> του; ποῦ ἡ <placeName>Ποικίλη Στοὰ</placeName> καὶ\n" +
    "               τὰ ἀριστουργήματα τοῦ <persName>Ζεύξιδος</persName> καὶ\n" +
    "                  <persName>Πολυγνώτου</persName> της; ποῦ ἡ <orgName>Ἀκαδημία</orgName>, καὶ ὁ\n" +
    "                  <persName>Πλάτων</persName> της; ποῦ τὸ <placeName>Πάνθεον</placeName>, καὶ τὰ\n" +
    "                  <orgName>Παναθήναιά</orgName> του; ποῦ οἱ περὶ τὸ <placeName>Σούνιον</placeName>\n" +
    "               ναυτικοὶ ἀγῶνες; ὁ Φαληρεύς, ὁ Πειρεεὺς καὶ ἡ Μουνυχία ἔρημοι· μονόξυλον κατῴκει τοὺς\n" +
    "               λιμένας τούτους τῶν τετρακοσίων τριήρεων… ἡ Σελήνη ἐν τοσούτῳ ἀνέτειλε· τὸ\n" +
    "               μελαγχολικὸν φῶς της ἔθαλπε τὸ μέτωπόν μου· χαῖρε γῆ, ἔκραξα, κεκαλυμμένη ἀπὸ πένθος,\n" +
    "               καὶ κλαίουσα ὡς ἐγώ· σὲ ἀφίνω γῆ! πρὸς τὴν ὁποίαν ἡ φαντασία μου θέλει πάντοτε\n" +
    "               ἀποβλέπει! ὦ γῆ! φιλοξενοῦσα τὴν <persName>Κοραλίαν</persName> μου, χαῖρε! καὶ αὖθις\n" +
    "               χαῖρε! </p>\n" +
    "         </div>\n" +
    "         <div n=\"32\" type=\"chapter\">\n" +
    "            <head>ΕΠΙΣΤΟΛΗ ΛΒ΄. Ὁ αὐτός.</head>\n" +
    "            <opener><dateline>15 Ἰαννουαρίου.</dateline></opener>\n" +
    "            <p>Πόσον τρομερὰ εἰς τοὺς δυστυχεῖς τῆς αὐγῆς ἡ παρουσία! φρικώδεις αἱ στιγμαὶ, ὅταν αἱ\n" +
    "               συγκεχυμέναι εἰκόνες τῆς θλιβερᾶς ἡμῶν θέσεως ἐπανέρχωνται· ζητοῦμεν νὰ ἐπαναπέσωμεν\n" +
    "               εἰς τὸν λήθαργον τοῦ ὕπνου, καὶ δὲν τολμῶμεν νὰ ἐπανακάμψωμεν εἰς τὴν ὕπαρξιν· ἀλλ'\n" +
    "               ἀγῶνες ἀνωφελεῖς· ὁ νοῦς ἐξυπνᾷ καὶ ἡ σιδηρᾶ Εἱμαρμένη γυμνή μᾶς παρουσιάζεται…\n" +
    "               φάντασμα ἐπαπειλητικόν! </p>\n" +
    "            <p>Ἡ αὐγὴ ἀνατέλλει πάλιν. Πόσαι ψυχραὶ καὶ ἀτελεύτητοι ὧραι μὲ περιμένουσι μέχρι τῆς\n" +
    "               ἑσπέρας!… </p>\n" +
    "            <p>Ὦ Θεέ! εἰς τὸν ὑλικόν σου κόσμον διατὶ ἔθεσας τοιαύτας πυρίνους ψυχάς, αἵτινες μόναι\n" +
    "               κατατρώγονται; διὰ ποίαν μεγαλοπρεπῆ τελετὴν τῆς φύσεως τὰς προώρισας ὁλοκαυτώματα;\n" +
    "               ποῖον μυστηριώδη σκοπόν σου, ἢ ποίαν μεγάλην ἀλήθειαν διὰ τῆς ἀποπυρακτώσεώς των\n" +
    "               μέλλουσι νὰ καθιερώσωσι!… </p>\n" +
    "            <p>Βλέπω, βλέπω κατάντικρυ μοναστήριον ἔρημον ἐκ πολλῶν ἐνιαυτῶν· εὐτυχεῖς ὅσοι\n" +
    "               ἀπετελείωσαν εἰς τὴν περιοχήν του τὴν ὁδοιπορίαν των! ὦ Ἅγια τῆς\n" +
    "                  <placeName>Ἑλλάδος</placeName> καταλύματα ἐρημούμενα καὶ καταῤῥέοντα! ὦ τῆς\n" +
    "               καταδιωκομένης ἀθωότητος ἄλλοτε ἄσυλα καὶ διδακτήρια! ὅταν τὴν ἑσπέραν τὸ\n" +
    "               μαργαρίτινον φῶς τῆς <placeName>Σελήνης</placeName> εἰς τὰς τεθραυσμένας στοὰς ὑμῶν\n" +
    "               ἐπιχύνεται, ὅταν θορυβώδεις οἱ καταῤῥάκται τὴν μεγαλοπρεπῆ φωνήν των συναρμόζωσι μετὰ\n" +
    "               τῆς βοῆς τῶν ἀνέμων, τότε βλέπω τοὺς σταυροὺς τῶν κοιμητηρίων σας καὶ τὰ ὑψηλὰ χόρτα\n" +
    "               τῶν μνημάτων σας, καὶ «Εἴθε, φωνάζω, εἰς τοὺς ἁγίους κοιτῶνάς σας καὶ ἐγὼ νὰ ἔζων καὶ\n" +
    "               ν' ἀπέθνησκον ἄγνωστος!» </p>\n" +
    "         </div>\n" +
    "         <div n=\"33\" type=\"chapter\">\n" +
    "            <head>ΕΠΙΣΤΟΛΗ ΛΓ΄. Ὁ αὐτός.</head>\n" +
    "            <opener><dateline>16 Ἰαννουαρίου.</dateline></opener>\n" +
    "            <p>Χθὲς ἐκ τῆς λύπης παράφορος, ἀπεπλανήθην τῆς ὁδοῦ μου, καὶ εἰς τὰ ὄρη μὲ κατέλαβεν ἡ\n" +
    "               λαίλαψ. </p>\n" +
    "            <p>Νεφέλαι βροντώδεις καὶ πυρόεσσαι περιέφερον εἰς τοὺς οὐρανοὺς τὸν ἐρισμάραγον\n" +
    "               κεραυνόν. Εἰς τὴν γῆν, οἱ ἄνεμοι ἐζήτουν νὰ σαλεύσωσι τὰς ὑψαυχένους ἀκρωρείας, καὶ\n" +
    "               εἰς τὴν θάλασσαν ἐσείοντο τοῦ Ποσειδῶνος τὰ Ἀνακτόρεια… Κρημνοὶ ἔμπροσθέν μου,\n" +
    "               βάραθρα ὄπισθεν· ἡ χιὼν πυκνὴ πίπτουσα· ἡ ὅρασίς μου ἐθαμβώθη· ἐκινδύνευον νὰ πέσω\n" +
    "               εἰς χάσματα· ὁ κίνδυνος ἦτον προφανής· ἐξαίφνης ἦχος σημάντρου μακρόθεν ἀκούεται,\n" +
    "               μετ' ὀλίγον βαυϊσμὸς σκύλακος, καὶ λευκογένειος ἱερεὺς ἔπειτα φαίνεται, λέγων με.\n" +
    "               «Τέκνον μου! εὐλογητὸς ὁ Θεός! σὲ παρετήρησα μακρόθεν ἀπὸ τὸ ἐρημητήριόν μου, καὶ νὰ\n" +
    "               σὲ σώσω ἦλθον. Εὐλογητὸς ὁ Θεὸς, τέκνον μου! ἐλθὲ εἰς τὸ ἐρημητήριόν μου.» </p>\n" +
    "            <p>Τὸν ἠκουλούθησα σιωπηλός· μετὰ στιγμάς τινας ἡ τρικυμία ἔπαυσεν· ἐκαθήσαμεν ἀμφότεροι\n" +
    "               ἐπὶ λόφου ὑψηλοῦ· ἡ θάλασσα κυαναυγής· καὶ ποντοπλάνοι δελφῖνες ὡδοιπόρουν. Δείξας με\n" +
    "               τὸ κελλείον του ὁ ἐρημίτης, κείμενον εἰς τοὺς πρόποδας ὄρους, «Ἐδῶ, τέκνον, εἶπε, ζῶ\n" +
    "               τὴν ἐν Χριστῷ κεκρυμμένην ὁδόν· ἐδῶ ἀγοράζω τὸν τίμιον, τὸν αἰώνιον μαργαρίτην, ἀντ'\n" +
    "               αὐτοῦ ἀποδίδων τὰ ῥέοντα καὶ συρόμενα τῶν ἐπιγείων. Εἰς τὰς πόλεις ὁ μὲν ἔνθεν, ὁ δὲ\n" +
    "               ἔνθεν διέλκουσιν ἡμᾶς καὶ ἀποσπῶσιν· ἀλλ' εἰς τὴν ἐρημίαν ὁ ἄνθρωπος ζῇ μεθ' ἑαυτοῦ,\n" +
    "               καὶ μετὰ τοῦ Θεοῦ του.» </p>\n" +
    "            <p>«Ἐντεῦθεν βλέπω εἰς τοὺς πόδας μου τὰς πόλεις, καὶ φωνάζω. Υἱοὶ ἀνθρώπων! τί ἀγαπᾶτε\n" +
    "               τὸν πλάνον κόσμον, καὶ τὰς κοσμικὰς ἐπιθυμίας! μέγα φρονεῖτε τὸν βίον, καὶ τὴν\n" +
    "               τρυφὴν, καὶ τὸ μικρὸν δοξάριον, καὶ τὴν δυναστείαν, ταῦτα τὰ ὡς καπνὸς διαῤῥέοντα,\n" +
    "               καὶ τὰ ὡς σκιὰ μὴ κρατούμενα;» </p>\n" +
    "            <p>«Διατὶ τρέχετε τὸν βίον ἐρίζοντες, παραγκωνιζόμενοι, ἀπαυδοῦντες καὶ πνιγόμενοι ἀπὸ\n" +
    "               τὸν κονιορτόν· δὲν σκέπτεσθε, ὅτι τάφρος θανάτου τὸ τέλος τοῦ σταδίου;…» </p>\n" +
    "            <p>«Ἐπειδὴ τὸ παραπέτασμα μέλλει νὰ πέσῃ καὶ νὰ διαῤῥαγῶσιν αἱ ματαιότητες ὡς\n" +
    "               πομφόλυγες, πρὸς τί βαθμοὶ καὶ δόξαι, καὶ μεγαλειότητες, καὶ λαμπρότητες γένους,\n" +
    "               ἀθλιότητες καὶ μωρίαι τοῦ κοινωνικοῦ ἀνθρώπου;» </p>\n" +
    "            <p>Ἐλάλει ὁ ἄνθρωπος τῶν ὑγειῶν ἰδεῶν, καὶ οἱ ἄνεμοι ἐκίνουν τὸ ῥάσον του, καὶ\n" +
    "               ἀνεκάλυπτον τὸν κολοβωθέντα εἰς τὴν ἱερὰν ἠμῶν ἐπανάστασιν βραχίονά του. </p>\n" +
    "            <p>Ἡ νὺξ ἔῤῥιψε τέλος τὸν μέλανά της πέπλον, καὶ ἡ δαδοῦχος κόρη τῶν οὐρανῶν ἐφάνη·\n" +
    "               ἠκολούθησα τὸν γέροντα εἰς τὸ κελλείον του, ἔπεσα εἰς τὴν φιλόξενον κλίνην, καὶ ὁ\n" +
    "               λυσιμέριμνος ὕπνος εἰς τὰς ἀγκάλας του μ' ἐδέχθη. </p>\n" +
    "            <p>Ἐξύπνησα τὴν αὐγήν· ποία φύσις ὡραία! ἐφύσων αὖραι ζεφυρίτιδες ψιθυραί· ὁ ἥλιος\n" +
    "               φαιδρωπὸς, ὄμμα δικαιοσύνης, ζωῆς φῶς· αἱ ἀκτῖνές του ἔπαιζον εἰς ἄνθη ποικιλόχροα,\n" +
    "               καὶ εἰς τὰ ὄμματά μου ἐφαίνοντο ὁ ἔμπλεως γάλακτος σάπφειρος, ὁ ἴασπις, ὁ κρύσταλλος\n" +
    "               καὶ τὸ κοράλλιον. </p>\n" +
    "         </div>\n" +
    "         <div n=\"34\" type=\"chapter\">\n" +
    "            <head>ΕΠΙΣΤΟΛΗ ΛΔ΄. Ὁ αὐτὸς πρὸς τὸν αὐτόν.</head>\n" +
    "            <opener><dateline>16 Ἰαννουαρίου.</dateline></opener>\n" +
    "            <p>Πόσαι μάστιγες περιστοιχίζουσι τὴν ἀνθρωπότητα! αἱ νόσοι, αἱ πυρκαϊαὶ, οἱ σεισμοὶ, αἱ\n" +
    "               τρικυμίαι, οἱ πόλεμοι, ἡ ἀμάθεια, καὶ οἱ τύραννοι! Ὁ ἄνθρωπος γεννᾶται· ἡ πρώτη φωνή\n" +
    "               του φωνὴ ὀδύνης, καὶ ἡ τελευταία του φωνὴ πάλιν ὀδύνης. Εἰς τὴν βρεφικὴν ἡλικίαν αἱ\n" +
    "               ὀδύναι τῶν σπαργάνων καὶ τῆς ὀργανώσεως· εἰς τὴν παιδικὴν οἱ διδάσκαλοι καὶ τὰ\n" +
    "               βιβλία· εἰς τὴν νεανικὴν τὰ πάθη· εἰς τὴν ἀνδρικὴν ἡ δυστυχὴς πραγματικότης τοῦ βίου·\n" +
    "               καὶ εἰς τὸ γῆρας αἱ ἀδυναμίαι καὶ ὁ φόβος τοῦ θανάτου. </p>\n" +
    "            <p>Τοὐλάχιστον ἂν ἡ ἀρετὴ δὲν ἔπασχεν· ἀλλ' οἱ αἰῶνες εἶδαν τὸν\n" +
    "                  <persName>Ἀριστείδην</persName> ἐξοστρακιζόμενον, καὶ τὸν\n" +
    "                  <persName>Σωκράτην</persName> πίνοντα τὸ κώνειον. </p>\n" +
    "            <p>Τοὐλάχιστον ἂν ἡ φρόνησις μᾶς ἀπήλλαττεν ἀπὸ τὰ δεινά· πλὴν ὁ ἄνθρωπος\n" +
    "               περιστοιχιζόμενος ἀπὸ πληθὺν ὄντων ἀγνώστων, τί δύναται νὰ προβλέψῃ; </p>\n" +
    "            <p>Ἡ εὐτυχία λέξις φανταστική· ὂν ἀνύπαρκτον ἐπὶ τῆς γῆς· ὁ εὐτυχέστερος βίος ἔχει τὰς\n" +
    "               ἀκάνθας του. </p>\n" +
    "         </div>\n" +
    "         <div n=\"35\" type=\"chapter\">\n" +
    "            <head>ΕΠΙΣΤΟΛΗ ΛΕ΄. Ὁ αὐτός.</head>\n" +
    "            <opener><dateline>16 Ἰαννουαρίου.</dateline></opener>\n" +
    "            <p>Πανταχοῦ δυστυχίαι! πανταχοῦ ἀθλιότητες! ἀπηυδισμένος ἀπὸ τὴν ὁδοιπορίαν μου,\n" +
    "               ἐσταμάτησα σήμερον εἰς καλύβην κειμένην εἰς πρόποδας λοφίσκου· εἰς τὴν θύραν της\n" +
    "               ἐκάθητο νέος τυφλὸς θερμαινόμενος εἰς τὸν ἥλιον, καὶ πρὸς αὐτὸν στρέφων ὀφθαλμοὺς\n" +
    "               ἐσβεσμένους καὶ διψῶντας φωτὸς· ἐκράτει λύραν εἰς τὰς χεῖράς του καὶ λυπηροὺς ἤχους\n" +
    "               οἱ δάκτυλοί του ἔχυναν· ἡ γυνή του τὸν ἔβλεπε δακρύζουσα, καὶ εἰς τὰ γόνατά του δύο\n" +
    "               βρεφίδια ὡραῖα ἔπαιζον. </p>\n" +
    "            <p>Ἡ μικρὰ οἰκογένεια μ' ἐδέχθη φιλοξένως· ὁ τυφλὸς νέος, λόγιος, ὑπῆρξεν υἱὸς\n" +
    "               εὐκαταστάτου πατρός· εἰς τὴν <placeName>Αἴγυπτον</placeName> σταλεὶς ἀπὸ τὸν\n" +
    "                  <persName>Ἰβραΐμην</persName> δέσμιος, ἐπέστρεψεν εἰς τὴν\n" +
    "                  <placeName>Ἑλλάδα</placeName> πρὸ ἓξ ἐτῶν μὲ βεβλαμμένην ὅρασιν· ἐνυμφεύθη καὶ τὴν\n" +
    "               ἐστερήθη διόλου. </p>\n" +
    "            <p>«Ποία λύπη, μὲ εἶπε, νὰ θάλπω εἰς τὰς ἀγκάλας μου τὰ τέκνα μου καὶ νὰ μὴ γνωρίζω τοὺς\n" +
    "               χαρακτῆρας τῶν προσώπων των. Ποία λύπη νὰ μὴ βλέπω τὴν ἐνάρετον σύζυγόν μου· ὦ νεότης\n" +
    "               ἄχαρις, πόσα ἔτη ἆρά γε θέλω ζήσει!… τί σκοτεινὸν μέλλον ἐνώπιόν μου!» </p>\n" +
    "            <p>Καὶ πρὸς τὸν ἥλιον στρέψας ὀφθαλμοὺς λευκοὺς καὶ στερημένους κόρης «Χαῖρε, εἶπε, φῶς\n" +
    "               αἰώνιον! χαῖρε ὕψιστε θησαυρὲ τοῦ βίου! σὲ ζητεῖ ματαίως ὁ ἐσβεσμένος κύκλος τὸν\n" +
    "               ὀμμάτων μου εἰς τὰ σκότη ἀλιτεύων· δὲν ἐπισκέπτεσαι πλέον τὰ ψυχρὰ καὶ ἀνωφελῆ\n" +
    "               βλέφαρά μου· ἡ αὐγή, τὸ ἔαρ ἐπιστρέφουσι· μόνον σὺ δὲν ἐπιστρέφεις εἰς τὴν ὅρασίν\n" +
    "               μου· ἡ αὐγή μου ἔμεινε χωρὶς λάμψιν καὶ τὸ ἔαρ μου χωρὶς ῥόδα· δι' ἐμὲ ὁ κόσμος ἓν\n" +
    "               μόνον ἔχει χρῶμα, καὶ ὡς ὁ ἰχθὺς ἐν μέσῳ τοῦ ὕδατος, ζῶ ἐν μέσῳ τοῦ σκότους ἐγώ.» </p>\n" +
    "            <p>Ὦ πάθος πατριωτισμοῦ ἐμπεφυτευμένον εἰς τὴν καρδίαν τοῦ Ἕλληνος! πιστεύεις, φίλε, ὅτι\n" +
    "               μία τῶν μεγάλων αἰτιῶν τῆς λύπης τοῦ τυφλοῦ τούτου νέου εἶναι καὶ τὸ νὰ μὴ δύναται νὰ\n" +
    "               ἰδῇ τῆς <placeName>Ἑλλάδος</placeName> τὸν Βασιλέα! «Αὐτὸς εἶναι (μὲ εἶπεν ὁ λόγιος\n" +
    "               τυφλός) ἡ εὔχαρις εἰκὼν τῆς ἀνεξαρτησίας ἠμῶν· ὁ θρόνος του, φανὸς ἀναμμένος κατὰ τὴν\n" +
    "                  <placeName>Μεσόγειον</placeName>, πρὸς ὃν ἀποβλέπουσιν αἱ ὑπὸ τὸν Ὀθωμανὸν\n" +
    "               Ἑλληνικαὶ Ἐπαρχίαι· ἡ τάσις τῆς χειρός του δύναται νὰ κινήσῃ ὅλην τὴν ἀπὸ\n" +
    "                  <placeName>Βοσπόρου</placeName> μέχρι <placeName>Κρήτης</placeName> Ἑλληνικὴν\n" +
    "               φυλήν, καὶ τὸ νεῦμά του σύνθημα τῆς γενικῆς ἀναστατώσεως. </p>\n" +
    "            <p>Ἀκούω ἐνίοτε τὸν ταχὺν ποδόκτυπον τοῦ ἵππου του, διαβαίνοντος ἐκ τῆς καλύβης μου, καὶ\n" +
    "               ῥίγος ἐνθουσιασμοῦ κυριεύει τὰ μέλη μου· καὶ τὸν σταυρὸν μου κάμνω, λέγων· «Θεέ!\n" +
    "               εὐλογητὸν τὸ ὄνομά σου· ἡ <placeName>Ἑλλὰς</placeName> ἀνεγεννήθη.» </p>\n" +
    "         </div>\n" +
    "         <div n=\"16\" type=\"chapter\">\n" +
    "            <head>ΕΠΙΣΤΟΛΗ ΛΣΤ΄. Ὁ αὐτός.</head>\n" +
    "            <opener><dateline>Ἐκ τῆς Προνοίας, 17 Ἰαννουαρίου.</dateline></opener>\n" +
    "            <p>Ἀνέτειλεν ἡ σελήνη· τῆς νυκτὸς ὁ μελαγχολικὸς καὶ γλυκὺς ὀφθαλμὸς ἀνέτειλεν! ἄφες με,\n" +
    "               ὕπνε, ἄφες με νὰ χαρῶ τοῦ ἀγαπητοῦ ἀστέρος μου τὸν γαληναῖον δίσκον. </p>\n" +
    "            <p>Θεέ! ὁ αἴθριος οὗτος καὶ μελαγχολικὸς θόλος, ἡ ἀνατέλλουσα ἐπὶ τῆς φύσεως ἀμυδρὰ\n" +
    "               ἡμέρα, τὸ διὰ τῶν κλάδων τοῦ δάσους διαχυνόμενον ἀμφίβολον φῶς, τὸ πᾶν ἐφησυχάζει τὴν\n" +
    "               ὅρασιν, καὶ ἀναπαύει τὴν ψυχήν. </p>\n" +
    "            <p>Βασίλισσα τῆς νυκτός! ὅταν σὲ βλέπω, τῆς πρώτης μου νεότητος τὰς γλυκείας ἡμέρας\n" +
    "               ἐνθυμοῦμαι καὶ πόθους ἀπεριορίστους αἰσθάνομαι. Βασίλισσα τῆς νυκτός! μὲ ἀνακαλεῖς\n" +
    "               καὶ τὰς ματαιωθείσας ἐλπίδας μου, καὶ τοὺς ἀποθανόντας φίλους μου. </p>\n" +
    "            <p>Ὁ περιπλανώμενος εἰς τὸ πέλαγος ὁδοιπόρος ἀνατέλλουσαν σὲ βλέπει τὴν στιγμὴν ταύτην,\n" +
    "               καὶ παρηγορεῖται· ἀλλ' εἰς ἐμὲ ἡ γαλήνη σου γεννᾷ τὴν τρικυμίαν, ὦ ἄστρον τῶν λυπηρῶν\n" +
    "               ἐνθυμήσεων! </p>\n" +
    "            <p>Ὁ περιπλανώμενος εἰς τὸ πέλαγος ὁδοιπόρος ἀνατέλλουσαν σὲ βλέπει τὴν στιγμὴν ταύτην,\n" +
    "               καὶ παρηγορεῖται· ἀλλ' εἰς ἐμὲ ἡ γαλήνη σου γεννᾷ τὴν τρικυμίαν, ὦ ἄστρον τῶν λυπηρῶν\n" +
    "               ἐνθυμήσεων! </p>\n" +
    "            <p>Ὡς σεμνὴ καὶ ὡραῖα παρθένος, μυστηριωδῶς ἐξέρχεσαι ἀπὸ τὰ νέφη τὴν ἑσπέραν ταύτην καὶ\n" +
    "               φωτίζεις τὸ κρυερόν μου μέτωπον· αἱ ἀκτίνές σου διατὶ μὲ θάλπουν, ὦ Σελήνη φιλη καὶ\n" +
    "               ἀόρατος χεὶρ χύνει τὸ παρηγορητικόν σου φῶς εἰς τὸ πρόσωπόν μου; </p>\n" +
    "            <p>Τὴν ὥραν ταύτην, ἐξ Ἀθηνῶν ἴσως σὲ βλέπει τῆς Κοραλίας ὁ ὀφθαλμός, ἴσως αἱ ἀκτῖνές\n" +
    "               σου ἐγγίζουν τὸ πρόσωπόν της. Σελήνη γλυκεῖα! ἔγγιζε καὶ τὴν νεκράν μου μορφήν·\n" +
    "               Σελήνη γλυκεῖα! θάλπε καὶ τὰ πάλλοντα στήθη μου. </p>\n" +
    "         </div>\n" +
    "\n" +
    "      </body>\n" +
    "   </text>\n" +
    "</TEI>";

/* global Promise */
define(function f(require) {
    "use strict";

    const wed = require("wed");
    const $ = require("jquery");
    const globalConfig = require("global-config");
    const mergeOptions = require("merge-options");

    function getOptions() {
        return {
            "ajaxlog": {
                "url": "/storage/log.txt"
            },
            "save": {
                "path": "./wed/savers/ajax",
                "options": {
                    "url": "/storage/save.txt"
                }
            }
        }
    }

    $(function ready() {
        var widget = document.getElementById("widget");
        var finalOptions = mergeOptions({}, globalConfig.config, getOptions());
        window.wed_editor = wed.makeEditor(widget, finalOptions);
        window.wed_editor.init(defaultTEI);
    });
});



